# sudo apt install git - установка контроля версий

# git - система контроля версий - программа для управления версиями кода 
# github - сервис для хранения кода 

# репозиторий - папка с которой может взаимодействовать git

# git init - превращает текущую  

# git status - проверка статуса репозитория 
# git add <file_name> / git add . - добавить файлы к отслеживанию изменений
# git commit -m "комментарий к версии" - сохранения версии кода / создание коммита
# git remote add <название - переменной> (принято назвать "origin") <ссылка на удаленный-репазиторий> - соединение локального репозитория с удаленным
# git push <название - переменной> <название - ветки> - отправка версии на github